---
kind: other
id: Methods.T:Autodesk.Revit.DB.PhaseFilter
source: html/d8310462-081a-a181-097a-b3c3ef2c50ec.htm
---
# PhaseFilter Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.